#===============================================================
# 高级绘图ver.2016.2.23 by Messiah Chong
#===============================================================

#---------------------------------------------------------------
# 绘制二维图形
#---------------------------------------------------------------
x=(0:100)*2*pi/100
y=sin(x)
plot(y)              # 只将一个向量作为函数参数则向量的值作为y轴
                     # 的值，x轴的值由R自动产生。
plot(x,y)            # 将两个向量作为函数参数则第一个向量作为x轴
                     # 的值，第二个向量作为y轴的值。

#---------------------------------------------------------------
# matplot()函数将两个矩阵作为参数。一个矩阵的列参照另一个矩阵的
# 相应列来绘制图形。在绘制同一个图时，两个矩阵的行数应该一样。如
# 果行数不一样，行数较少的那个矩阵用缺失值（用NA表示）来填充。第
# 一个矩阵的值会用在横轴上。如果其中一个矩阵只有一个列，则绘制的
# 所有图形都将用该列的值。每一对列所绘制的图形颜色不一样，编号会
# 用来作为点的图形符号。这些选项也可由用户自己定义（col=,pach=）。
#---------------------------------------------------------------
x=(0:100)*2*pi/100
y1=sin(x)
y2=cos(x)
y=cbind(y1,y2)       # cbind()将列向量按列合并成矩阵。
matplot(x,y)

#---------------------------------------------------------------
# 可用一些选项来定制R绘制的图形。在函数plot()和matplot()中，选项
# 通常作为附加参数被调用。可选参数能以任意顺序输入（在用于绘图的
# 向量之后），以逗号分隔。
#---------------------------------------------------------------

#----------------------------------------------------
# 数据符号类型
#----------------------------------------------------
x=0:20
y=x/x                    # y为21个1组成的向量。
plot(x,y,pch=0:20)       # 图为参数pch为0~20代表
                         # 的符号。

#----------------------------------------------------
# 连接线类型
#----------------------------------------------------
x=1:6
y1=1*(x/x)
y2=2*(x/x)
y3=3*(x/x)
y4=4*(x/x)
y5=5*(x/x)
y6=6*(x/x)
y=cbind(y1,y2,y3,y4,y5,y6)
matplot(x,y,type="l",
        lty=1:6)         # lty控制线的样式，图为1~6
                         # 代表的线条。

#----------------------------------------------------
# 曲线类型
#----------------------------------------------------
x=1:6
y1=1*(x/x)
y2=2*(x/x)
y3=3*(x/x)
y4=4*(x/x)
y5=5*(x/x)
y6=6:1
y=cbind(y1,y2,y3,y4,y5,y6)
matplot(x,y,type=c("p","l","o","b","h","s"))
                        # type参数用来指定不同曲线类型。

#----------------------------------------------------
# 坐标轴限制
# 选项xlim=和ylim=可分别用来限制横轴和纵轴的范围，如
# xlim=c(1,10)，会让R只是用横轴值在0~10范围内的数据，
# 如果数据超出此范围则不会出现在绘制的图形中。
#----------------------------------------------------

#----------------------------------------------------
# 刻度线
#----------------------------------------------------
x=(0:100)*2*pi/100
y=sin(x)
plot(x,y,tcl=.5)       # tcl控制刻度线的长度，负值为
                       # 刻度线在轴外。

#----------------------------------------------------
# 坐标轴标签
# 通过xlab="",ylab=""来修改。
#----------------------------------------------------

#----------------------------------------------------
# 不显示坐标轴
# axes=FALSE为不显示坐标轴，ann=FALSE为不显示坐标轴标签。
#----------------------------------------------------

#----------------------------------------------------
# 符号与标签的大小，线与坐标轴的宽度。
# Cex.axis=为轴宽的倍数。
# Cex.lab=为轴标签文本大小的倍数。
# Cex.main=为标题文本大小的倍数。
# Cex.sub=为子标题文本大小的倍数。
# Lwd=为所画线宽度的倍数。
#----------------------------------------------------

#----------------------------------------------------
# 添加点和线
# 通过points()和matpoints()可添加点，通过lines()和
# matlines()可添加线。函数segments()用来将间断无连接
# 线段添加到现有图形中。
#----------------------------------------------------
x0=c(2,2,3,4)
y0=c(2,3,2,2)
x1=c(2,3,3,4)
y1=c(4,3,4,4)
x=c(0,3)
y=c(0,3)
plot(x,y,type="l",xlim=c(0,5),ylim=c(0,5))
segments(x0,y0,x1,y1)     # 前两个向量给出起始点
                          # 横纵坐标，后两个向量
                          # 给出终止点横纵坐标。
abline(1,3)               # 添加一条1为截距，3为
                          # 斜率的直线。
abline(h=2)               # 添加一条y=2的水平直线。
abline(v=2)               # 添加一条x=2的垂直直线。

#----------------------------------------------------
# 增加文本
#----------------------------------------------------
x=c(2.5,1,1,4,4)
y=c(2.5,1,4,4,1)
plot(x,y,type="p",
     xlim=c(0,5),ylim=c(0,5))
text(x[2:5],y[2:5],
     c("bottom","left","top","right"),
     pos=1:4)
text(x[1],y[1],c("overlay"))  # 两个向量作为坐标值，
                              # pos给出文本相对于
                              # 坐标的位置，不指定
                              # 则叠加在中心点上。

#----------------------------------------------------
# 标题和副标题
#----------------------------------------------------
X=c(1,2,3)
Y=c(3,3,3)
plot(X,Y)
title(main="wow what a plot")  # 用title()函数增加标题。

x=c(1,2,3)
y=c(3,3,3)
plot(x,y,main="wow what a plot") # 直接在plot()函数中
                                 # 修改参数。
X=c(1,2,3)
Y=c(3,3,3)
plot(X,Y)
title(main=c("wow","what a plot"))  # 文本参数为字符串
                                    # 向量会生成多行标题。

X=c(1,2,3)
Y=c(3,3,3)
plot(X,Y)
title(main="wow what a plot",
      sub="and the labels rock too") # sub()函数添加副标题。

#----------------------------------------------------
# 图例
#----------------------------------------------------
x=(0:100)*2*pi/100
y1=sin(x)
y2=cos(x)
y=cbind(y1,y2)
matplot(x,y,type="l",
        lty=c(1,2),col="black")
legend(3,1,c("sine","cosine"),
       lty=c(1,2))                 # legend()函数前两个参数
                                   # 为左上角的坐标，接下来
                                   # 是图例文本和绘图符号，
                                   # 如pch=,lty=。

#----------------------------------------------------
# 用Windows()命令可以打开一个新的图形窗口
#----------------------------------------------------

#----------------------------------------------------
# 多屏图
#----------------------------------------------------
layout(matrix(c(1,2,3,4),2,2))
x=(0:100)*2*pi/100
y1=sin(x)
y2=cos(x)
y=cbind(y1,y2)
matplot(x,y,type="l",
        lty=c(1,2),col="black")
plot(x,y1)
plot(x,y2)
plot(x)                           # layout()函数参数为一个
                                  # 矩阵，矩阵中的元素为1，
                                  # 2，……，k，k为要绘制的
                                  # 面板个数，后两个参数设置
                                  # 行数和列数。

#----------------------------------------------------
# 散点图
#----------------------------------------------------
plot(iris)

#----------------------------------------------------
# 颜色
# col=用来指定plot()和matplot()函数中数据符号和曲线的颜色，
# 还有barplot()函数生成的条形图颜色。
# col.axis=坐标轴的颜色。
# col.lab=坐标轴标签的颜色。
# col.main=主标题颜色。
# col.sub=子标题颜色。
# 颜色可通过代码指定（1~657），或直接写名称。
#----------------------------------------------------
x=(0:100)*2*p/100
y1=sin(x)
y2=cos(x)
y=cbind(y1,y2)
matplot(x,y,type="l",lty=c(1,2),
        col=c("red","blue"),
        main="colorful picture",
        col.main="black",col.lab=3,
        col.axis=7)